src/cf/Enums/GDS_СостоянияПроверкиАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>GDS_СостоянияПроверкиАПП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исправно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неисправно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вналичии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Просрочено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/GDS_АктПриемаПередачиТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>GDS_АктПриемаПередачиТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.GDS_ЭлементыПроверки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОсмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сдал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсмотрПровел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Одометр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеКСостояниюПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платон</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдометрТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдометрПрицеп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдометрПрицепТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегПрицеп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокТопливаПрицеп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматированноеОписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПринял</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПрицеп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлементыПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.GDS_ПунктыПроверкиТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.GDS_СостоянияПроверкиАПП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПроблем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Замечания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтветственныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/GDS_РаботаСФормитированнымОписаниемСервер/Ext/Module.bsl
Функция СформироватьФорматированнуюСтроку(ДокументАПП) Экспорт
	//Получим данные по идентификатору
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	GDS_АктПриемаПередачиТСЭлементыПроверки.ТС КАК ТС,
		|	GDS_АктПриемаПередачиТСЭлементыПроверки.ЭлементПроверки КАК ЭлементПроверки,
		|	GDS_АктПриемаПередачиТСЭлементыПроверки.Состояние КАК Состояние,
		|	GDS_АктПриемаПередачиТСЭлементыПроверки.Замечания КАК Замечания
		|ПОМЕСТИТЬ ВТ_ВсеПункты
		|ИЗ
		|	Документ.GDS_АктПриемаПередачиТС.ЭлементыПроверки КАК GDS_АктПриемаПередачиТСЭлементыПроверки
		|ГДЕ
		|	GDS_АктПриемаПередачиТСЭлементыПроверки.Ссылка = &Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеПункты.ТС КАК ТС,
		|	ВТ_ВсеПункты.ЭлементПроверки КАК ЭлементПроверки,
		|	ВТ_ВсеПункты.Состояние КАК Состояние,
		|	ВТ_ВсеПункты.Замечания КАК Замечания
		|ИЗ
		|	ВТ_ВсеПункты КАК ВТ_ВсеПункты
		|ГДЕ
		|	ВТ_ВсеПункты.ТС <> ЗНАЧЕНИЕ(Справочник.уатТС.ПустаяССылка)
		|	И ВТ_ВсеПункты.Состояние = ЗНАЧЕНИЕ(Перечисление.GDS_СостоянияПроверкиАПП.Исправно)
		|	И ВТ_ВсеПункты.Замечания <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ВсеПункты.ТС,
		|	ВТ_ВсеПункты.ЭлементПроверки,
		|	ВТ_ВсеПункты.Состояние,
		|	ВТ_ВсеПункты.Замечания
		|ИЗ
		|	ВТ_ВсеПункты КАК ВТ_ВсеПункты
		|ГДЕ
		|	ВТ_ВсеПункты.ТС = ЗНАЧЕНИЕ(Справочник.уатТС.ПустаяССылка)
		|	И ВТ_ВсеПункты.Состояние <> ЗНАЧЕНИЕ(Перечисление.GDS_СостоянияПроверкиАПП.Исправно)
		|	И ВТ_ВсеПункты.Состояние <> ЗНАЧЕНИЕ(Перечисление.GDS_СостоянияПроверкиАПП.Вналичии)
		|ИТОГИ ПО
		|	ТС";
	Запрос.УстановитьПараметр("Документ", ДокументАПП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТС = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивСтрок = Новый Массив;
	
	//заголовок для начала
	ЗаголовокНаименование = "Добрый день! Перечень неисправности техники";	
	РезвизитЗаголовок = Новый ФорматированнаяСтрока(ЗаголовокНаименование, Новый Шрифт("Arial",10));
	МассивСтрок.Добавить(РезвизитЗаголовок);
	
	//переход на новую строку
	МассивСтрок.Добавить(Символы.ПС);
	//переход на новую строку
	МассивСтрок.Добавить(Символы.ПС);
	
	Пока ВыборкаТС.Следующий() Цикл
		
		Если ВыборкаТС.ТС <> Справочники.уатТС.ПустаяСсылка() Тогда
			ЗаголовокНачала = "АВТОТРАНСПОРТ:";
		Иначе
			ЗаголовокНачала = "ВВЕРХНЕЕ ОБОРУДОВАНИЕ/ПРИЦЕП:";
		КонецЕсли;
		
		//заголовок для начала АВТО
		ЗаголовокАвто = Новый ФорматированнаяСтрока(ЗаголовокНачала, Новый Шрифт("Arial",10,Истина));	
		МассивСтрок.Добавить(ЗаголовокАвто);
		
		//переход на новую строку
		МассивСтрок.Добавить(Символы.ПС);
		
		ВыборкаДетальныеЗаписи = ВыборкаТС.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//МассивПроблем = Новый Массив;
			
			//1. Заголовок проблемы
			ПроблемаЗаголовок	= ВыборкаДетальныеЗаписи.ЭлементПроверки;
			
			РезвизитПроблемаЗаголовок = Новый ФорматированнаяСтрока(Строка(ПроблемаЗаголовок), Новый Шрифт("Arial",10));
			МассивСтрок.Добавить(РезвизитПроблемаЗаголовок);
			
			//переход на новую строку
			МассивСтрок.Добавить(Символы.ПС);
			
			//2. Статус проблемы
			СостояниеПроверки = ВыборкаДетальныеЗаписи.Состояние;
			
			Если СостояниеПроверки = Перечисления.GDS_СостоянияПроверкиАПП.Исправно Тогда
				ЦветТекстаСостояние = WebЦвета.Зеленый;
			Иначе
				ЦветТекстаСостояние = WebЦвета.Красный;
			КонецЕсли;
			
			МассивСтатус = Новый Массив;
			МассивСтатус.Добавить(Новый ФорматированнаяСтрока("Статус: ",Новый Шрифт("Arial",10)));
			МассивСтатус.Добавить(Новый ФорматированнаяСтрока(Строка(СостояниеПроверки),Новый Шрифт("Arial",10), ЦветТекстаСостояние));
			
			РезвизитПроблемаСтатус = Новый ФорматированнаяСтрока(МассивСтатус);
			МассивСтрок.Добавить(РезвизитПроблемаСтатус);
			
			//переход на новую строку
			МассивСтрок.Добавить(Символы.ПС);
			
			//3. Комментарий проблемы
			КомментарийПровеки = ВыборкаДетальныеЗаписи.Замечания;
			
			Если ЗначениеЗаполнено(КомментарийПровеки) Тогда
				ЦветФонаКомментарий = ЦветаСтиля.ФонРезультатовПоиска;
			Иначе
				КомментарийПровеки = " ";
				ЦветФонаКомментарий = ЦветаСтиля.ЦветКалендаряФонПустойЯчейкиВсегоДня;
			КонецЕсли;
			
			МассивКомментарий = Новый Массив;
			МассивКомментарий.Добавить(Новый ФорматированнаяСтрока("Комментарий: ",Новый Шрифт("Arial",10)));
			МассивКомментарий.Добавить(Новый ФорматированнаяСтрока(КомментарийПровеки, Новый Шрифт("Arial",10),, ЦветФонаКомментарий));
			
			РезвизитПроблемаКомментарий = Новый ФорматированнаяСтрока(МассивКомментарий);
			МассивСтрок.Добавить(РезвизитПроблемаКомментарий);
			
			//переход на новую строку
			МассивСтрок.Добавить(Символы.ПС);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецФункции

Функция ПолучитьВсеПунктыПроверки(НаименованиеПроблемы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	GDS_ПунктыПроверкиТС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.GDS_ПунктыПроверкиТС КАК GDS_ПунктыПроверкиТС
	|ГДЕ
	|	GDS_ПунктыПроверкиТС.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеПроблемы);
	
	Возврат НЕ Запрос.Выполнить().Пустой()
	
КонецФункции

Функция ПолучитьФормитированнуюСтроку(ДокументАПП) Экспорт
	
	Строка = СформироватьФорматированнуюСтроку(ДокументАПП.Ссылка);
	
	ОписаниеФорматированногоДокумента = Новый ФорматированныйДокумент;
	
	ОписаниеФорматированногоДокумента.УстановитьФорматированнуюСтроку(Строка);
	
	Для Каждого Параграф Из ОписаниеФорматированногоДокумента.Элементы Цикл
		Если Параграф.ТипПараграфа = ТипПараграфа.Обычный Тогда
			ОбработатьОбычныйПараграф(Параграф);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОписаниеФорматированногоДокумента;
	
КонецФункции

Процедура ОбработатьОбычныйПараграф(ДанныеПараграфа)
	Если ДанныеПараграфа.Элементы.Количество() > 1 Тогда
		ДанныеПараграфа.Отступ = 40;
	Иначе
		Для каждого СтрПараграфа Из ДанныеПараграфа.Элементы Цикл
			РезультатПроверки = ПолучитьВсеПунктыПроверки(СтрПараграфа.Текст);
			Если РезультатПроверки Тогда
				СтрПараграфа.Родитель.ТипПараграфа = ТипПараграфа.МаркированныйСписок;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
